music_app/app/controllers/bands_controller.rb

    def destroy
        @band.destroy
---
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]

    def set_band
        @band = Band.find(params[:id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]